{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_15"}, "name": "input_15", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 257, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_7", "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_14", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_14", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}, "shared_object_id": 6}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_14", "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_15", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_15", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 10}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 11}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 12}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}, "shared_object_id": 13}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_15", "inbound_nodes": [[["bidirectional_14", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_7", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_7", "inbound_nodes": [[["bidirectional_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_28", "inbound_nodes": [[["layer_normalization_7", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "dtype": "float32", "rate": 0.35, "noise_shape": null, "seed": null}, "name": "dropout_14", "inbound_nodes": [[["dense_28", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_29", "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.35, "noise_shape": null, "seed": null}, "name": "dropout_15", "inbound_nodes": [[["dense_29", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_31", "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_30", "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_7", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_7", "inbound_nodes": [["dense_31", 0, 0, {"y": 1e-06, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_7", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_7", "inbound_nodes": [[["dense_30", 0, 0, {"axis": -1}], ["tf.__operators__.add_7", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_7", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_7", "inbound_nodes": [["tf.stack_7", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_15", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_7", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_14/forward_lstm_14/lstm_cell_43/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_14/forward_lstm_14/lstm_cell_43/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_14/forward_lstm_14/lstm_cell_43/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_14/backward_lstm_14/lstm_cell_44/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_14/backward_lstm_14/lstm_cell_44/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_14/backward_lstm_14/lstm_cell_44/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_15/lstm_cell_46/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_15/lstm_cell_46/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_15/lstm_cell_46/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_15/lstm_cell_47/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_15/lstm_cell_47/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_15/lstm_cell_47/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_28/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_28/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_29/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_29/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_30/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_30/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_31/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_31/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_7/embeddings", "shape": [257, 64], "dtype": "float32"}, {"name": "layer_normalization_7/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_7/beta", "shape": [128], "dtype": "float32"}]}]}