{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_13"}, "name": "input_13", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 256, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_8", "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_16", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_16", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_16", "inbound_nodes": [[["embedding_8", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_17", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_17", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_17", "inbound_nodes": [[["bidirectional_16", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_8", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_8", "inbound_nodes": [[["bidirectional_17", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_32", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_32", "inbound_nodes": [[["layer_normalization_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_33", "inbound_nodes": [[["dense_32", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_34", "inbound_nodes": [[["dense_33", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_35", "inbound_nodes": [[["dense_33", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0]], "output_layers": [["dense_34", 0, 0], ["dense_35", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_16/forward_lstm_16/lstm_cell_49/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_16/forward_lstm_16/lstm_cell_49/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_16/forward_lstm_16/lstm_cell_49/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_16/lstm_cell_50/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_16/lstm_cell_50/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_16/lstm_cell_50/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_17/lstm_cell_52/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_17/lstm_cell_52/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_17/lstm_cell_52/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_17/lstm_cell_53/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_17/lstm_cell_53/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_17/lstm_cell_53/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_32/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_32/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_33/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_33/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_34/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_34/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_35/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_35/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_8/embeddings", "shape": [256, 64], "dtype": "float32"}, {"name": "layer_normalization_8/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_8/beta", "shape": [128], "dtype": "float32"}]}]}