{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_75"}, "name": "input_75", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_74", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_74", "inbound_nodes": [[["input_75", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_148", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_148", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_148", "inbound_nodes": [[["embedding_74", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_149", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_149", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_149", "inbound_nodes": [[["bidirectional_148", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_74", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_74", "inbound_nodes": [[["bidirectional_149", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_296", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_296", "inbound_nodes": [[["layer_normalization_74", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_297", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_297", "inbound_nodes": [[["dense_296", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_298", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_298", "inbound_nodes": [[["dense_297", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_299", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_299", "inbound_nodes": [[["dense_297", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_78", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_78", "inbound_nodes": [[["dense_298", 0, 0, {"axis": -1}], ["dense_299", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_78", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_78", "inbound_nodes": [["tf.stack_78", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_75", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_78", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_148/forward_lstm_148/lstm_cell_577/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_148/forward_lstm_148/lstm_cell_577/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_148/forward_lstm_148/lstm_cell_577/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_148/backward_lstm_148/lstm_cell_578/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_148/backward_lstm_148/lstm_cell_578/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_148/backward_lstm_148/lstm_cell_578/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_149/forward_lstm_149/lstm_cell_580/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_149/forward_lstm_149/lstm_cell_580/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_149/forward_lstm_149/lstm_cell_580/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_149/backward_lstm_149/lstm_cell_581/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_149/backward_lstm_149/lstm_cell_581/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_149/backward_lstm_149/lstm_cell_581/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_296/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_296/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_297/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_297/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_298/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_298/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_299/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_299/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_74/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_74/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_74/beta", "shape": [128], "dtype": "float32"}]}]}