{"vocab": ["[nop]", "[Cl-1]", "[=P]", "[Cu+1]", "[/C@]", "[=Si]", "[Ce]", "[\\C]", "[I-1]", "[B]", "[PH1]", "[K]", "[#S@]", "[Ni]", "[S-1]", "[Ar]", "[Hg+2]", "[S@@+1]", "[Nd]", "[\\NH1+1]", "[O-1]", "[Ne]", "[Bi+3]", "[\\N]", "[=W]", "[Ag]", "[#Branch3]", "[SiH1]", "[Na]", "[=N-1]", "[Sb]", "[NH4+1]", "[\\-Ring1]", "[Nd+3]", "[\\Br]", "[Cs]", "[N@]", "[Nb]", "[C@]", "[Ti+2]", "[Sn+2]", "[Sn+4]", "[Ni+2]", "[Al]", "[Cd]", "[Br]", "[Cr+3]", "[V]", "[=Mn]", "[Mg+2]", "[SnH2]", "[Te]", "[Pt+4]", "[=Ring2]", "[NH0]", "[=Branch1]", "[Au]", "[/NH1]", "[Sr]", "[Br-1]", "[CH2]", "[B-1]", "[=Cr]", "[W]", "[B+3]", "[Ir]", "[=Cd]", "[=Ge]", "[/S]", "[=NH1+1]", "[C+1]", "[\\NH0]", "[\\O]", "[-/Ring2]", "[=V]", "[=V+2]", "[Se]", "[H-1]", "[Xe]", "[\\S]", "[H]", "[Ag+1]", "[Pd+2]", "[Fe+3]", "[Zr+4]", "[Y+3]", "[=O]", "[As]", "[#Branch1]", "[SH1]", "[N]", "[C@@]", "[SH0]", "[/O]", "[=Zr]", "[Co]", "[\\O-1]", "[=P@]", "[S+1]", "[/C@H1]", "[#N]", "[Hg+1]", "[Hf+4]", "[N@@+1]", "[\\C@]", "[Zr+2]", "[\\F]", "[=S+1]", "[Be]", "[Kr]", "[Pb]", "[=S]", "[MgH2]", "[Branch1]", "[/F]", "[\\-Ring2]", "[Y]", "[Ring2]", "[Hf]", "[V+2]", "[=Cu]", "[S@@]", "[OH1-1]", "[C]", "[/NH0]", "[=P+1]", "[Ca]", "[Ca+2]", "[Ba+2]", "[=Co]", "[SiH3]", "[Dy]", "[Fe]", "[=P@@]", "[I]", "[=N+1]", "[Co+2]", "[Ring1]", "[\\Cl]", "[=Branch3]", "[Lu+3]", "[Pr+3]", "[=N]", "[/N]", "[S]", "[/N+1]", "[Na+1]", "[/Cl]", "[=Ce]", "[Cd+2]", "[=Fe]", "[C@H1]", "[NH1]", "[=C-1]", "[/O-1]", "[Mo]", "[#O+1]", "[Mn+3]", "[/C@@]", "[Branch3]", "[Cu]", "[Sm+3]", "[=Ti]", "[N@+1]", "[CH1]", "[#C-1]", "[NH1-1]", "[Au+1]", "[N+1]", "[H+1]", "[=C]", "[K+1]", "[/C]", "[Nop]", "[Li+1]", "[Co+3]", "[=SH0]", "[Mo+2]", "[S@+1]", "[Ti+4]", "[=Be]", "[Al+3]", "[Zn+2]", "[=As]", "[P+1]", "[Bi]", "[Mn]", "[\\NH1]", "[/Br]", "[Branch2]", "[/NH1+1]", "[Ce+3]", "[=O+1]", "[=Nb]", "[C@@H1]", "[Li]", "[Ring3]", "[=SH1]", "[=Mo]", "[S-2]", "[P@@]", "[Cr]", "[Si]", "[=Pb]", "[=Te]", "[/-Ring2]", "[=Sn]", "[Mn+2]", "[FH0]", "[-\\Ring1]", "[Si+4]", "[La+3]", "[Cl]", "[F-1]", "[-/Ring1]", "[SH1-1]", "[BH0]", "[In+3]", "[Cs+1]", "[Rh]", "[=PH1]", "[CaH2]", "[Fe+2]", "[NH3+1]", "[=Zn]", "[Gd]", "[Hg]", "[=Ring3]", "[-\\Ring2]", "[=Y]", "[#B]", "[=Ca]", "[Ta]", "[C-1]", "[O]", "[#N+1]", "[Gd+3]", "[P]", "[=CH0]", "[Pt+2]", "[#Branch2]", "[Sn]", "[\\As]", "[Re]", "[S@]", "[As+3]", ".", "[O+1]", "[/C@@H1]", "[Ru+3]", "[O-2]", "[Nb+5]", "[SH1-2]", "[ClH0]", "[\\N+1]", "[NH1+1]", "[=SnH2]", "[P@]", "[CH1-1]", "[CH0]", "[Ge]", "[Au+3]", "[=Branch2]", "[Dy+3]", "[/-Ring1]", "[NH1+2]", "[\\C@H1]", "[Rh+3]", "[\\C@@H1]", "[PH0]", "[#C]", "[Sb+3]", "[/As]", "[=Se]", "[OH0]", "[NH2+1]", "[La]", "[2H]", "[Cu+2]", "[=Ni]", "[=Ring1]", "[F]", "[Si@]", "[\\I]", "[Ti]", "[Zr]", "[Cl+3]", "[Mg]", "[Zn]", "[/I]", "[=PH0]", "[Pb+2]", "[=Sr]", "[Sr+2]", "[=B]", "[N-1]", "[#S]"], "vocab_stoi": {"[nop]": 0, "[Cl-1]": 1, "[=P]": 2, "[Cu+1]": 3, "[/C@]": 4, "[=Si]": 5, "[Ce]": 6, "[\\C]": 7, "[I-1]": 8, "[B]": 9, "[PH1]": 10, "[K]": 11, "[#S@]": 12, "[Ni]": 13, "[S-1]": 14, "[Ar]": 15, "[Hg+2]": 16, "[S@@+1]": 17, "[Nd]": 18, "[\\NH1+1]": 19, "[O-1]": 20, "[Ne]": 21, "[Bi+3]": 22, "[\\N]": 23, "[=W]": 24, "[Ag]": 25, "[#Branch3]": 26, "[SiH1]": 27, "[Na]": 28, "[=N-1]": 29, "[Sb]": 30, "[NH4+1]": 31, "[\\-Ring1]": 32, "[Nd+3]": 33, "[\\Br]": 34, "[Cs]": 35, "[N@]": 36, "[Nb]": 37, "[C@]": 38, "[Ti+2]": 39, "[Sn+2]": 40, "[Sn+4]": 41, "[Ni+2]": 42, "[Al]": 43, "[Cd]": 44, "[Br]": 45, "[Cr+3]": 46, "[V]": 47, "[=Mn]": 48, "[Mg+2]": 49, "[SnH2]": 50, "[Te]": 51, "[Pt+4]": 52, "[=Ring2]": 53, "[NH0]": 54, "[=Branch1]": 55, "[Au]": 56, "[/NH1]": 57, "[Sr]": 58, "[Br-1]": 59, "[CH2]": 60, "[B-1]": 61, "[=Cr]": 62, "[W]": 63, "[B+3]": 64, "[Ir]": 65, "[=Cd]": 66, "[=Ge]": 67, "[/S]": 68, "[=NH1+1]": 69, "[C+1]": 70, "[\\NH0]": 71, "[\\O]": 72, "[-/Ring2]": 73, "[=V]": 74, "[=V+2]": 75, "[Se]": 76, "[H-1]": 77, "[Xe]": 78, "[\\S]": 79, "[H]": 80, "[Ag+1]": 81, "[Pd+2]": 82, "[Fe+3]": 83, "[Zr+4]": 84, "[Y+3]": 85, "[=O]": 86, "[As]": 87, "[#Branch1]": 88, "[SH1]": 89, "[N]": 90, "[C@@]": 91, "[SH0]": 92, "[/O]": 93, "[=Zr]": 94, "[Co]": 95, "[\\O-1]": 96, "[=P@]": 97, "[S+1]": 98, "[/C@H1]": 99, "[#N]": 100, "[Hg+1]": 101, "[Hf+4]": 102, "[N@@+1]": 103, "[\\C@]": 104, "[Zr+2]": 105, "[\\F]": 106, "[=S+1]": 107, "[Be]": 108, "[Kr]": 109, "[Pb]": 110, "[=S]": 111, "[MgH2]": 112, "[Branch1]": 113, "[/F]": 114, "[\\-Ring2]": 115, "[Y]": 116, "[Ring2]": 117, "[Hf]": 118, "[V+2]": 119, "[=Cu]": 120, "[S@@]": 121, "[OH1-1]": 122, "[C]": 123, "[/NH0]": 124, "[=P+1]": 125, "[Ca]": 126, "[Ca+2]": 127, "[Ba+2]": 128, "[=Co]": 129, "[SiH3]": 130, "[Dy]": 131, "[Fe]": 132, "[=P@@]": 133, "[I]": 134, "[=N+1]": 135, "[Co+2]": 136, "[Ring1]": 137, "[\\Cl]": 138, "[=Branch3]": 139, "[Lu+3]": 140, "[Pr+3]": 141, "[=N]": 142, "[/N]": 143, "[S]": 144, "[/N+1]": 145, "[Na+1]": 146, "[/Cl]": 147, "[=Ce]": 148, "[Cd+2]": 149, "[=Fe]": 150, "[C@H1]": 151, "[NH1]": 152, "[=C-1]": 153, "[/O-1]": 154, "[Mo]": 155, "[#O+1]": 156, "[Mn+3]": 157, "[/C@@]": 158, "[Branch3]": 159, "[Cu]": 160, "[Sm+3]": 161, "[=Ti]": 162, "[N@+1]": 163, "[CH1]": 164, "[#C-1]": 165, "[NH1-1]": 166, "[Au+1]": 167, "[N+1]": 168, "[H+1]": 169, "[=C]": 170, "[K+1]": 171, "[/C]": 172, "[Nop]": 173, "[Li+1]": 174, "[Co+3]": 175, "[=SH0]": 176, "[Mo+2]": 177, "[S@+1]": 178, "[Ti+4]": 179, "[=Be]": 180, "[Al+3]": 181, "[Zn+2]": 182, "[=As]": 183, "[P+1]": 184, "[Bi]": 185, "[Mn]": 186, "[\\NH1]": 187, "[/Br]": 188, "[Branch2]": 189, "[/NH1+1]": 190, "[Ce+3]": 191, "[=O+1]": 192, "[=Nb]": 193, "[C@@H1]": 194, "[Li]": 195, "[Ring3]": 196, "[=SH1]": 197, "[=Mo]": 198, "[S-2]": 199, "[P@@]": 200, "[Cr]": 201, "[Si]": 202, "[=Pb]": 203, "[=Te]": 204, "[/-Ring2]": 205, "[=Sn]": 206, "[Mn+2]": 207, "[FH0]": 208, "[-\\Ring1]": 209, "[Si+4]": 210, "[La+3]": 211, "[Cl]": 212, "[F-1]": 213, "[-/Ring1]": 214, "[SH1-1]": 215, "[BH0]": 216, "[In+3]": 217, "[Cs+1]": 218, "[Rh]": 219, "[=PH1]": 220, "[CaH2]": 221, "[Fe+2]": 222, "[NH3+1]": 223, "[=Zn]": 224, "[Gd]": 225, "[Hg]": 226, "[=Ring3]": 227, "[-\\Ring2]": 228, "[=Y]": 229, "[#B]": 230, "[=Ca]": 231, "[Ta]": 232, "[C-1]": 233, "[O]": 234, "[#N+1]": 235, "[Gd+3]": 236, "[P]": 237, "[=CH0]": 238, "[Pt+2]": 239, "[#Branch2]": 240, "[Sn]": 241, "[\\As]": 242, "[Re]": 243, "[S@]": 244, "[As+3]": 245, ".": 246, "[O+1]": 247, "[/C@@H1]": 248, "[Ru+3]": 249, "[O-2]": 250, "[Nb+5]": 251, "[SH1-2]": 252, "[ClH0]": 253, "[\\N+1]": 254, "[NH1+1]": 255, "[=SnH2]": 256, "[P@]": 257, "[CH1-1]": 258, "[CH0]": 259, "[Ge]": 260, "[Au+3]": 261, "[=Branch2]": 262, "[Dy+3]": 263, "[/-Ring1]": 264, "[NH1+2]": 265, "[\\C@H1]": 266, "[Rh+3]": 267, "[\\C@@H1]": 268, "[PH0]": 269, "[#C]": 270, "[Sb+3]": 271, "[/As]": 272, "[=Se]": 273, "[OH0]": 274, "[NH2+1]": 275, "[La]": 276, "[2H]": 277, "[Cu+2]": 278, "[=Ni]": 279, "[=Ring1]": 280, "[F]": 281, "[Si@]": 282, "[\\I]": 283, "[Ti]": 284, "[Zr]": 285, "[Cl+3]": 286, "[Mg]": 287, "[Zn]": 288, "[/I]": 289, "[=PH0]": 290, "[Pb+2]": 291, "[=Sr]": 292, "[Sr+2]": 293, "[=B]": 294, "[N-1]": 295, "[#S]": 296}}