{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_32"}, "name": "input_32", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_31", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_31", "inbound_nodes": [[["input_32", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_62", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_62", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_62", "inbound_nodes": [[["embedding_31", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_63", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_63", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_63", "inbound_nodes": [[["bidirectional_62", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_31", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_31", "inbound_nodes": [[["bidirectional_63", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_124", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_124", "inbound_nodes": [[["layer_normalization_31", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_125", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_125", "inbound_nodes": [[["dense_124", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_126", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_126", "inbound_nodes": [[["dense_125", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_127", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_127", "inbound_nodes": [[["dense_125", 0, 0, {}]]]}], "input_layers": [["input_32", 0, 0]], "output_layers": [["dense_126", 0, 0], ["dense_127", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_62/forward_lstm_62/lstm_cell_307/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_62/forward_lstm_62/lstm_cell_307/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_62/forward_lstm_62/lstm_cell_307/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_62/backward_lstm_62/lstm_cell_308/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_62/backward_lstm_62/lstm_cell_308/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_62/backward_lstm_62/lstm_cell_308/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_63/forward_lstm_63/lstm_cell_310/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_63/forward_lstm_63/lstm_cell_310/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_63/forward_lstm_63/lstm_cell_310/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_63/backward_lstm_63/lstm_cell_311/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_63/backward_lstm_63/lstm_cell_311/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_63/backward_lstm_63/lstm_cell_311/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_124/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_124/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_125/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_125/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_126/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_126/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_127/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_127/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_31/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_31/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_31/beta", "shape": [128], "dtype": "float32"}]}]}