{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_76"}, "name": "input_76", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_75", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_75", "inbound_nodes": [[["input_76", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_150", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_150", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_150", "inbound_nodes": [[["embedding_75", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_151", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_151", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_151", "inbound_nodes": [[["bidirectional_150", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_75", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_75", "inbound_nodes": [[["bidirectional_151", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_300", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_300", "inbound_nodes": [[["layer_normalization_75", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_301", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_301", "inbound_nodes": [[["dense_300", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_302", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_302", "inbound_nodes": [[["dense_301", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_303", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_303", "inbound_nodes": [[["dense_301", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_79", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_79", "inbound_nodes": [[["dense_302", 0, 0, {"axis": -1}], ["dense_303", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_79", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_79", "inbound_nodes": [["tf.stack_79", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_76", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_79", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_150/forward_lstm_150/lstm_cell_583/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_150/forward_lstm_150/lstm_cell_583/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_150/forward_lstm_150/lstm_cell_583/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_150/backward_lstm_150/lstm_cell_584/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_150/backward_lstm_150/lstm_cell_584/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_150/backward_lstm_150/lstm_cell_584/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_151/forward_lstm_151/lstm_cell_586/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_151/forward_lstm_151/lstm_cell_586/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_151/forward_lstm_151/lstm_cell_586/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_151/backward_lstm_151/lstm_cell_587/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_151/backward_lstm_151/lstm_cell_587/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_151/backward_lstm_151/lstm_cell_587/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_300/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_300/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_301/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_301/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_302/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_302/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_303/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_303/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_75/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_75/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_75/beta", "shape": [128], "dtype": "float32"}]}]}