{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_82"}, "name": "input_82", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_81", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_81", "inbound_nodes": [[["input_82", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_162", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_162", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_162", "inbound_nodes": [[["embedding_81", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_163", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_163", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_163", "inbound_nodes": [[["bidirectional_162", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_81", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_81", "inbound_nodes": [[["bidirectional_163", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_324", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_324", "inbound_nodes": [[["layer_normalization_81", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_325", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_325", "inbound_nodes": [[["dense_324", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_326", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_326", "inbound_nodes": [[["dense_325", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_327", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_327", "inbound_nodes": [[["dense_325", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_85", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_85", "inbound_nodes": [[["dense_326", 0, 0, {"axis": -1}], ["dense_327", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_85", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_85", "inbound_nodes": [["tf.stack_85", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_82", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_85", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_162/forward_lstm_162/lstm_cell_619/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_162/forward_lstm_162/lstm_cell_619/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_162/forward_lstm_162/lstm_cell_619/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_162/backward_lstm_162/lstm_cell_620/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_162/backward_lstm_162/lstm_cell_620/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_162/backward_lstm_162/lstm_cell_620/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_163/forward_lstm_163/lstm_cell_622/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_163/forward_lstm_163/lstm_cell_622/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_163/forward_lstm_163/lstm_cell_622/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_163/backward_lstm_163/lstm_cell_623/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_163/backward_lstm_163/lstm_cell_623/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_163/backward_lstm_163/lstm_cell_623/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_324/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_324/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_325/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_325/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_326/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_326/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_327/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_327/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_81/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_81/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_81/beta", "shape": [128], "dtype": "float32"}]}]}