{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_80"}, "name": "input_80", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_79", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_79", "inbound_nodes": [[["input_80", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_158", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_158", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_158", "inbound_nodes": [[["embedding_79", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_159", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_159", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_159", "inbound_nodes": [[["bidirectional_158", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_79", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_79", "inbound_nodes": [[["bidirectional_159", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_316", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_316", "inbound_nodes": [[["layer_normalization_79", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_317", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_317", "inbound_nodes": [[["dense_316", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_318", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_318", "inbound_nodes": [[["dense_317", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_319", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_319", "inbound_nodes": [[["dense_317", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_83", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_83", "inbound_nodes": [[["dense_318", 0, 0, {"axis": -1}], ["dense_319", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_83", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_83", "inbound_nodes": [["tf.stack_83", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_80", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_83", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_158/forward_lstm_158/lstm_cell_607/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_158/forward_lstm_158/lstm_cell_607/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_158/forward_lstm_158/lstm_cell_607/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_158/backward_lstm_158/lstm_cell_608/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_158/backward_lstm_158/lstm_cell_608/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_158/backward_lstm_158/lstm_cell_608/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_159/forward_lstm_159/lstm_cell_610/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_159/forward_lstm_159/lstm_cell_610/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_159/forward_lstm_159/lstm_cell_610/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_159/backward_lstm_159/lstm_cell_611/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_159/backward_lstm_159/lstm_cell_611/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_159/backward_lstm_159/lstm_cell_611/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_316/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_316/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_317/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_317/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_318/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_318/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_319/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_319/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_79/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_79/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_79/beta", "shape": [128], "dtype": "float32"}]}]}