{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_78"}, "name": "input_78", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_77", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_77", "inbound_nodes": [[["input_78", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_154", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_154", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_154", "inbound_nodes": [[["embedding_77", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_155", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_155", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_155", "inbound_nodes": [[["bidirectional_154", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_77", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_77", "inbound_nodes": [[["bidirectional_155", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_308", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_308", "inbound_nodes": [[["layer_normalization_77", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_309", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_309", "inbound_nodes": [[["dense_308", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_310", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_310", "inbound_nodes": [[["dense_309", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_311", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_311", "inbound_nodes": [[["dense_309", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_81", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_81", "inbound_nodes": [[["dense_310", 0, 0, {"axis": -1}], ["dense_311", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_81", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_81", "inbound_nodes": [["tf.stack_81", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_78", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_81", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_154/forward_lstm_154/lstm_cell_595/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_154/forward_lstm_154/lstm_cell_595/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_154/forward_lstm_154/lstm_cell_595/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_154/backward_lstm_154/lstm_cell_596/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_154/backward_lstm_154/lstm_cell_596/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_154/backward_lstm_154/lstm_cell_596/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_155/forward_lstm_155/lstm_cell_598/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_155/forward_lstm_155/lstm_cell_598/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_155/forward_lstm_155/lstm_cell_598/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_155/backward_lstm_155/lstm_cell_599/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_155/backward_lstm_155/lstm_cell_599/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_155/backward_lstm_155/lstm_cell_599/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_308/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_308/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_309/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_309/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_310/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_310/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_311/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_311/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_77/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_77/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_77/beta", "shape": [128], "dtype": "float32"}]}]}