{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_16"}, "name": "input_16", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_11", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 256, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_11", "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_22", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_22", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_22", "inbound_nodes": [[["embedding_11", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_23", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_23", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_23", "inbound_nodes": [[["bidirectional_22", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_11", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_11", "inbound_nodes": [[["bidirectional_23", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_44", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_44", "inbound_nodes": [[["layer_normalization_11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_45", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_45", "inbound_nodes": [[["dense_44", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_46", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_46", "inbound_nodes": [[["dense_45", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_47", "inbound_nodes": [[["dense_45", 0, 0, {}]]]}], "input_layers": [["input_16", 0, 0]], "output_layers": [["dense_46", 0, 0], ["dense_47", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_22/forward_lstm_22/lstm_cell_67/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_22/forward_lstm_22/lstm_cell_67/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_22/forward_lstm_22/lstm_cell_67/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_22/backward_lstm_22/lstm_cell_68/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_22/backward_lstm_22/lstm_cell_68/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_22/backward_lstm_22/lstm_cell_68/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_23/forward_lstm_23/lstm_cell_70/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_23/forward_lstm_23/lstm_cell_70/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_23/forward_lstm_23/lstm_cell_70/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_23/backward_lstm_23/lstm_cell_71/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_23/backward_lstm_23/lstm_cell_71/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_23/backward_lstm_23/lstm_cell_71/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_44/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_44/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_45/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_45/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_46/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_46/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_47/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_47/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_11/embeddings", "shape": [256, 64], "dtype": "float32"}, {"name": "layer_normalization_11/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_11/beta", "shape": [128], "dtype": "float32"}]}]}