{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_68"}, "name": "input_68", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_39", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 259, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_39", "inbound_nodes": [[["input_68", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_78", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_78", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_78", "inbound_nodes": [[["embedding_39", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_79", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_79", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_79", "inbound_nodes": [[["bidirectional_78", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_39", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_39", "inbound_nodes": [[["bidirectional_79", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_156", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_156", "inbound_nodes": [[["layer_normalization_39", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_157", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_157", "inbound_nodes": [[["dense_156", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_158", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_158", "inbound_nodes": [[["dense_157", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_159", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_159", "inbound_nodes": [[["dense_157", 0, 0, {}]]]}], "input_layers": [["input_68", 0, 0]], "output_layers": [["dense_158", 0, 0], ["dense_159", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_78/forward_lstm_78/lstm_cell_235/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_78/forward_lstm_78/lstm_cell_235/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_78/forward_lstm_78/lstm_cell_235/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_78/backward_lstm_78/lstm_cell_236/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_78/backward_lstm_78/lstm_cell_236/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_78/backward_lstm_78/lstm_cell_236/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_79/forward_lstm_79/lstm_cell_238/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_79/forward_lstm_79/lstm_cell_238/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_79/forward_lstm_79/lstm_cell_238/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_79/backward_lstm_79/lstm_cell_239/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_79/backward_lstm_79/lstm_cell_239/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_79/backward_lstm_79/lstm_cell_239/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_156/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_156/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_157/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_157/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_158/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_158/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_159/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_159/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_39/embeddings", "shape": [259, 64], "dtype": "float32"}, {"name": "layer_normalization_39/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_39/beta", "shape": [128], "dtype": "float32"}]}]}