{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_81"}, "name": "input_81", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_80", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_80", "inbound_nodes": [[["input_81", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_160", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_160", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_160", "inbound_nodes": [[["embedding_80", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_161", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_161", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_161", "inbound_nodes": [[["bidirectional_160", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_80", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_80", "inbound_nodes": [[["bidirectional_161", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_320", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_320", "inbound_nodes": [[["layer_normalization_80", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_321", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_321", "inbound_nodes": [[["dense_320", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_322", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_322", "inbound_nodes": [[["dense_321", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_323", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_323", "inbound_nodes": [[["dense_321", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_84", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_84", "inbound_nodes": [[["dense_322", 0, 0, {"axis": -1}], ["dense_323", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_84", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_84", "inbound_nodes": [["tf.stack_84", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_81", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_84", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_160/forward_lstm_160/lstm_cell_613/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_160/forward_lstm_160/lstm_cell_613/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_160/forward_lstm_160/lstm_cell_613/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_160/backward_lstm_160/lstm_cell_614/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_160/backward_lstm_160/lstm_cell_614/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_160/backward_lstm_160/lstm_cell_614/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_161/forward_lstm_161/lstm_cell_616/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_161/forward_lstm_161/lstm_cell_616/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_161/forward_lstm_161/lstm_cell_616/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_161/backward_lstm_161/lstm_cell_617/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_161/backward_lstm_161/lstm_cell_617/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_161/backward_lstm_161/lstm_cell_617/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_320/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_320/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_321/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_321/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_322/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_322/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_323/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_323/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_80/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_80/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_80/beta", "shape": [128], "dtype": "float32"}]}]}