{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_37"}, "name": "input_37", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_36", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_36", "inbound_nodes": [[["input_37", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_72", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_72", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_72", "inbound_nodes": [[["embedding_36", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_73", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_73", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_73", "inbound_nodes": [[["bidirectional_72", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_36", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_36", "inbound_nodes": [[["bidirectional_73", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_144", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_144", "inbound_nodes": [[["layer_normalization_36", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_145", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_145", "inbound_nodes": [[["dense_144", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_146", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_146", "inbound_nodes": [[["dense_145", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_147", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_147", "inbound_nodes": [[["dense_145", 0, 0, {}]]]}], "input_layers": [["input_37", 0, 0]], "output_layers": [["dense_146", 0, 0], ["dense_147", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_72/forward_lstm_72/lstm_cell_337/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_72/forward_lstm_72/lstm_cell_337/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_72/forward_lstm_72/lstm_cell_337/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_72/backward_lstm_72/lstm_cell_338/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_72/backward_lstm_72/lstm_cell_338/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_72/backward_lstm_72/lstm_cell_338/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_73/forward_lstm_73/lstm_cell_340/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_73/forward_lstm_73/lstm_cell_340/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_73/forward_lstm_73/lstm_cell_340/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_73/backward_lstm_73/lstm_cell_341/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_73/backward_lstm_73/lstm_cell_341/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_73/backward_lstm_73/lstm_cell_341/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_144/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_144/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_145/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_145/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_146/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_146/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_147/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_147/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_36/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_36/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_36/beta", "shape": [128], "dtype": "float32"}]}]}