{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_79"}, "name": "input_79", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_78", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_78", "inbound_nodes": [[["input_79", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_156", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_156", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_156", "inbound_nodes": [[["embedding_78", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_157", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_157", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_157", "inbound_nodes": [[["bidirectional_156", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_78", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_78", "inbound_nodes": [[["bidirectional_157", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_312", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_312", "inbound_nodes": [[["layer_normalization_78", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_313", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_313", "inbound_nodes": [[["dense_312", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_314", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_314", "inbound_nodes": [[["dense_313", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_315", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_315", "inbound_nodes": [[["dense_313", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_82", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_82", "inbound_nodes": [[["dense_314", 0, 0, {"axis": -1}], ["dense_315", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_82", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_82", "inbound_nodes": [["tf.stack_82", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_79", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_82", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_156/forward_lstm_156/lstm_cell_601/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_156/forward_lstm_156/lstm_cell_601/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_156/forward_lstm_156/lstm_cell_601/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_156/backward_lstm_156/lstm_cell_602/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_156/backward_lstm_156/lstm_cell_602/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_156/backward_lstm_156/lstm_cell_602/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_157/forward_lstm_157/lstm_cell_604/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_157/forward_lstm_157/lstm_cell_604/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_157/forward_lstm_157/lstm_cell_604/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_157/backward_lstm_157/lstm_cell_605/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_157/backward_lstm_157/lstm_cell_605/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_157/backward_lstm_157/lstm_cell_605/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_312/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_312/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_313/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_313/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_314/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_314/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_315/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_315/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_78/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_78/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_78/beta", "shape": [128], "dtype": "float32"}]}]}