{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_33"}, "name": "input_33", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_32", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_32", "inbound_nodes": [[["input_33", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_64", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_64", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_64", "inbound_nodes": [[["embedding_32", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_65", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_65", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_65", "inbound_nodes": [[["bidirectional_64", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_32", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_32", "inbound_nodes": [[["bidirectional_65", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_128", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_128", "inbound_nodes": [[["layer_normalization_32", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_129", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_129", "inbound_nodes": [[["dense_128", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_130", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_130", "inbound_nodes": [[["dense_129", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_131", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_131", "inbound_nodes": [[["dense_129", 0, 0, {}]]]}], "input_layers": [["input_33", 0, 0]], "output_layers": [["dense_130", 0, 0], ["dense_131", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_64/forward_lstm_64/lstm_cell_313/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_64/forward_lstm_64/lstm_cell_313/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_64/forward_lstm_64/lstm_cell_313/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_64/backward_lstm_64/lstm_cell_314/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_64/backward_lstm_64/lstm_cell_314/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_64/backward_lstm_64/lstm_cell_314/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_65/forward_lstm_65/lstm_cell_316/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_65/forward_lstm_65/lstm_cell_316/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_65/forward_lstm_65/lstm_cell_316/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_65/backward_lstm_65/lstm_cell_317/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_65/backward_lstm_65/lstm_cell_317/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_65/backward_lstm_65/lstm_cell_317/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_128/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_128/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_129/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_129/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_130/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_130/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_131/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_131/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_32/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_32/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_32/beta", "shape": [128], "dtype": "float32"}]}]}