{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.0.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_77"}, "name": "input_77", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_76", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 273, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_76", "inbound_nodes": [[["input_77", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_152", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_152", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_152", "inbound_nodes": [[["embedding_76", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_153", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_153", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_153", "inbound_nodes": [[["bidirectional_152", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_76", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_76", "inbound_nodes": [[["bidirectional_153", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_304", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_304", "inbound_nodes": [[["layer_normalization_76", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_305", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_305", "inbound_nodes": [[["dense_304", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_306", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_306", "inbound_nodes": [[["dense_305", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_307", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_307", "inbound_nodes": [[["dense_305", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_80", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_80", "inbound_nodes": [[["dense_306", 0, 0, {"axis": -1}], ["dense_307", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_80", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_80", "inbound_nodes": [["tf.stack_80", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_77", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_80", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_152/forward_lstm_152/lstm_cell_589/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_152/forward_lstm_152/lstm_cell_589/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_152/forward_lstm_152/lstm_cell_589/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_152/backward_lstm_152/lstm_cell_590/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_152/backward_lstm_152/lstm_cell_590/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_152/backward_lstm_152/lstm_cell_590/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_153/forward_lstm_153/lstm_cell_592/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_153/forward_lstm_153/lstm_cell_592/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_153/forward_lstm_153/lstm_cell_592/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_153/backward_lstm_153/lstm_cell_593/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_153/backward_lstm_153/lstm_cell_593/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_153/backward_lstm_153/lstm_cell_593/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_304/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_304/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_305/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_305/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_306/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_306/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_307/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_307/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_76/embeddings", "shape": [273, 64], "dtype": "float32"}, {"name": "layer_normalization_76/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_76/beta", "shape": [128], "dtype": "float32"}]}]}