{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn-infer", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_67"}, "name": "input_67", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_38", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 259, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_38", "inbound_nodes": [[["input_67", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_76", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_76", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_76", "inbound_nodes": [[["embedding_38", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_77", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_77", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_77", "inbound_nodes": [[["bidirectional_76", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_38", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_38", "inbound_nodes": [[["bidirectional_77", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_152", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_152", "inbound_nodes": [[["layer_normalization_38", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_153", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_153", "inbound_nodes": [[["dense_152", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_154", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_154", "inbound_nodes": [[["dense_153", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_155", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_155", "inbound_nodes": [[["dense_153", 0, 0, {}]]]}], "input_layers": [["input_67", 0, 0]], "output_layers": [["dense_154", 0, 0], ["dense_155", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_76/forward_lstm_76/lstm_cell_229/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_76/forward_lstm_76/lstm_cell_229/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_76/forward_lstm_76/lstm_cell_229/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_76/backward_lstm_76/lstm_cell_230/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_76/backward_lstm_76/lstm_cell_230/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_76/backward_lstm_76/lstm_cell_230/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_77/forward_lstm_77/lstm_cell_232/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_77/forward_lstm_77/lstm_cell_232/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_77/forward_lstm_77/lstm_cell_232/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_77/backward_lstm_77/lstm_cell_233/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_77/backward_lstm_77/lstm_cell_233/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_77/backward_lstm_77/lstm_cell_233/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_152/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_152/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_153/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_153/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_154/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_154/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_155/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_155/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_38/embeddings", "shape": [259, 64], "dtype": "float32"}, {"name": "layer_normalization_38/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_38/beta", "shape": [128], "dtype": "float32"}]}]}