{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "sol-rnn", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_13"}, "name": "input_13", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 257, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_6", "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_12", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_12", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}, "shared_object_id": 6}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_12", "inbound_nodes": [[["embedding_6", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_13", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_13", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 10}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 11}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 12}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}, "shared_object_id": 13}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_13", "inbound_nodes": [[["bidirectional_12", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_6", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_6", "inbound_nodes": [[["bidirectional_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 32, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [[["layer_normalization_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "dtype": "float32", "rate": 0.35, "noise_shape": null, "seed": null}, "name": "dropout_12", "inbound_nodes": [[["dense_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 16, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "dtype": "float32", "rate": 0.35, "noise_shape": null, "seed": null}, "name": "dropout_13", "inbound_nodes": [[["dense_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": "float32", "units": 1, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_27", "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_26", "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_6", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_6", "inbound_nodes": [["dense_27", 0, 0, {"y": 1e-06, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_6", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_6", "inbound_nodes": [[["dense_26", 0, 0, {"axis": -1}], ["tf.__operators__.add_6", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_6", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "name": "tf.compat.v1.squeeze_6", "inbound_nodes": [["tf.stack_6", 0, 0, {"axis": null, "name": null}]]}], "input_layers": [["input_13", 0, 0]], "output_layers": [["tf.compat.v1.squeeze_6", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_12/forward_lstm_12/lstm_cell_37/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_12/forward_lstm_12/lstm_cell_37/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_12/forward_lstm_12/lstm_cell_37/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_12/backward_lstm_12/lstm_cell_38/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_12/backward_lstm_12/lstm_cell_38/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_12/backward_lstm_12/lstm_cell_38/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_13/forward_lstm_13/lstm_cell_40/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_13/forward_lstm_13/lstm_cell_40/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_13/forward_lstm_13/lstm_cell_40/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_13/backward_lstm_13/lstm_cell_41/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_13/backward_lstm_13/lstm_cell_41/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_13/backward_lstm_13/lstm_cell_41/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_24/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_24/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_25/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_25/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_26/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_26/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_27/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_27/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_6/embeddings", "shape": [257, 64], "dtype": "float32"}, {"name": "layer_normalization_6/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_6/beta", "shape": [128], "dtype": "float32"}]}]}