{"vocab": ["[Nop]", ".", "[Rh+3]", "[Si+4]", "[Se]", "[Cs+1]", "[Zn]", "[\\Br]", "[#Branch1]", "[OH0]", "[Sn]", "[B+3]", "[#N+1]", "[OH1-1]", "[H+1]", "[Hg+1]", "[C@]", "[MgH2]", "[/As]", "[C-1]", "[Y+3]", "[Zr]", "[Bi+3]", "[ClH0]", "[Branch2]", "[Cd+2]", "[Ring2]", "[B]", "[=Se]", "[=W]", "[=Cd]", "[/NH1+1]", "[\\C@@H1]", "[=Sr]", "[Ca]", "[=Fe]", "[#C]", "[Cl]", "[Ni+2]", "[Pt+4]", "[=Branch1]", "[=Ring2]", "[Au+1]", "[C@H1]", "[Ca+2]", "[Pb]", "[=Nb]", "[Pb+2]", "[#Branch3]", "[Re]", "[Au]", "[Mg+2]", "[=C-1]", "[Ti]", "[Au+3]", "[=Branch2]", "[-\\Ring2]", "[SiH1]", "[Al]", "[Ru+3]", "[In+3]", "[F-1]", "[S-2]", "[=Be]", "[Fe+2]", "[P@@]", "[O-1]", "[#C-1]", "[/C@H1]", "[=NH1+1]", "[I]", "[La]", "[Co+3]", "[=O+1]", "[Cl+3]", "[O+1]", "[\\N+1]", "[Sr]", "[Hg+2]", "[Ir]", "[Gd+3]", "[Li+1]", "[Na]", "[Mn+2]", "[Nb+5]", "[K+1]", "[=N+1]", "[-/Ring1]", "[=S+1]", "[Fe+3]", "[O]", "[Br-1]", "[=S]", "[=Pb]", "[Sr+2]", "[Gd]", "[Be]", "[Zr+4]", "[=Ge]", "[/C@]", "[B-1]", "[Ag]", "[Mn]", "[=As]", "[S-1]", "[\\C@H1]", "[H]", "[=SnH2]", "[/NH1]", "[Te]", "[V+2]", "[#Branch2]", "[Y]", "[=Si]", "[\\I]", "[=Cr]", "[NH1+2]", "[Co+2]", "[=Branch3]", "[/O]", "[N+1]", "[C@@]", "[-\\Ring1]", "[=N-1]", "[S+1]", "[Branch1]", "[Branch3]", "[As+3]", "[Mo+2]", "[Pd+2]", "[\\C]", "[/N+1]", "[La+3]", "[2H]", "[Ti+2]", "[Hg]", "[Mg]", "[Ce+3]", "[Al+3]", "[N]", "[Si]", "[=Co]", "[/S]", "[Cr+3]", "[=V]", "[CH0]", "[=V+2]", "[Lu+3]", "[I-1]", "[NH4+1]", "[Zr+2]", "[SH1-2]", "[#O+1]", "[Hf]", "[\\As]", "[NH1+1]", "[Fe]", "[H-1]", "[Ring1]", "[/N]", "[C+1]", "[=Zr]", "[Nb]", "[\\S]", "[Bi]", "[Pr+3]", "[PH0]", "[Sn+2]", "[Na+1]", "[\\O]", "[/C@@H1]", "[V]", "[Cd]", "[=P+1]", "[P]", "[=Cu]", "[K]", "[Cu+1]", "[Ti+4]", "[\\Cl]", "[Li]", "[Nd]", "[=PH1]", "[Ge]", "[Cu+2]", "[Ta]", "[=Sn]", "[CaH2]", "[/C@@]", "[P@]", "[=Te]", "[C@@H1]", "[Ring3]", "[SnH2]", "[=Ce]", "[#S]", "[=B]", "[Rh]", "[/I]", "[Dy+3]", "[S]", "[=Ring1]", "[Nd+3]", "[Sm+3]", "[Cr]", "[O-2]", "[=Ca]", "[N-1]", "[Mo]", "[As]", "[SH1-1]", "[Pt+2]", "[=O]", "[Hf+4]", "[BH0]", "[P+1]", "[=Ti]", "[Ag+1]", "[Sb]", "[Co]", "[Ba+2]", "[=Zn]", "[Zn+2]", "[NH2+1]", "[=Ni]", "[Sn+4]", "[#B]", "[NH1]", "[Dy]", "[Cs]", "[C]", "[Sb+3]", "[=P]", "[W]", "[/Cl]", "[Cl-1]", "[F]", "[Ni]", "[=Mo]", "[/C]", "[Ce]", "[/Br]", "[=Ring3]", "[PH1]", "[#N]", "[-/Ring2]", "[Br]", "[NH3+1]", "[CH1-1]", "[=N]", "[=Y]", "[=C]", "[Mn+3]", "[=Mn]", "[FH0]", "[Cu]", "[\\N]"], "vocab_stoi": {"[Nop]": 0, ".": 1, "[Rh+3]": 2, "[Si+4]": 3, "[Se]": 4, "[Cs+1]": 5, "[Zn]": 6, "[\\Br]": 7, "[#Branch1]": 8, "[OH0]": 9, "[Sn]": 10, "[B+3]": 11, "[#N+1]": 12, "[OH1-1]": 13, "[H+1]": 14, "[Hg+1]": 15, "[C@]": 16, "[MgH2]": 17, "[/As]": 18, "[C-1]": 19, "[Y+3]": 20, "[Zr]": 21, "[Bi+3]": 22, "[ClH0]": 23, "[Branch2]": 24, "[Cd+2]": 25, "[Ring2]": 26, "[B]": 27, "[=Se]": 28, "[=W]": 29, "[=Cd]": 30, "[/NH1+1]": 31, "[\\C@@H1]": 32, "[=Sr]": 33, "[Ca]": 34, "[=Fe]": 35, "[#C]": 36, "[Cl]": 37, "[Ni+2]": 38, "[Pt+4]": 39, "[=Branch1]": 40, "[=Ring2]": 41, "[Au+1]": 42, "[C@H1]": 43, "[Ca+2]": 44, "[Pb]": 45, "[=Nb]": 46, "[Pb+2]": 47, "[#Branch3]": 48, "[Re]": 49, "[Au]": 50, "[Mg+2]": 51, "[=C-1]": 52, "[Ti]": 53, "[Au+3]": 54, "[=Branch2]": 55, "[-\\Ring2]": 56, "[SiH1]": 57, "[Al]": 58, "[Ru+3]": 59, "[In+3]": 60, "[F-1]": 61, "[S-2]": 62, "[=Be]": 63, "[Fe+2]": 64, "[P@@]": 65, "[O-1]": 66, "[#C-1]": 67, "[/C@H1]": 68, "[=NH1+1]": 69, "[I]": 70, "[La]": 71, "[Co+3]": 72, "[=O+1]": 73, "[Cl+3]": 74, "[O+1]": 75, "[\\N+1]": 76, "[Sr]": 77, "[Hg+2]": 78, "[Ir]": 79, "[Gd+3]": 80, "[Li+1]": 81, "[Na]": 82, "[Mn+2]": 83, "[Nb+5]": 84, "[K+1]": 85, "[=N+1]": 86, "[-/Ring1]": 87, "[=S+1]": 88, "[Fe+3]": 89, "[O]": 90, "[Br-1]": 91, "[=S]": 92, "[=Pb]": 93, "[Sr+2]": 94, "[Gd]": 95, "[Be]": 96, "[Zr+4]": 97, "[=Ge]": 98, "[/C@]": 99, "[B-1]": 100, "[Ag]": 101, "[Mn]": 102, "[=As]": 103, "[S-1]": 104, "[\\C@H1]": 105, "[H]": 106, "[=SnH2]": 107, "[/NH1]": 108, "[Te]": 109, "[V+2]": 110, "[#Branch2]": 111, "[Y]": 112, "[=Si]": 113, "[\\I]": 114, "[=Cr]": 115, "[NH1+2]": 116, "[Co+2]": 117, "[=Branch3]": 118, "[/O]": 119, "[N+1]": 120, "[C@@]": 121, "[-\\Ring1]": 122, "[=N-1]": 123, "[S+1]": 124, "[Branch1]": 125, "[Branch3]": 126, "[As+3]": 127, "[Mo+2]": 128, "[Pd+2]": 129, "[\\C]": 130, "[/N+1]": 131, "[La+3]": 132, "[2H]": 133, "[Ti+2]": 134, "[Hg]": 135, "[Mg]": 136, "[Ce+3]": 137, "[Al+3]": 138, "[N]": 139, "[Si]": 140, "[=Co]": 141, "[/S]": 142, "[Cr+3]": 143, "[=V]": 144, "[CH0]": 145, "[=V+2]": 146, "[Lu+3]": 147, "[I-1]": 148, "[NH4+1]": 149, "[Zr+2]": 150, "[SH1-2]": 151, "[#O+1]": 152, "[Hf]": 153, "[\\As]": 154, "[NH1+1]": 155, "[Fe]": 156, "[H-1]": 157, "[Ring1]": 158, "[/N]": 159, "[C+1]": 160, "[=Zr]": 161, "[Nb]": 162, "[\\S]": 163, "[Bi]": 164, "[Pr+3]": 165, "[PH0]": 166, "[Sn+2]": 167, "[Na+1]": 168, "[\\O]": 169, "[/C@@H1]": 170, "[V]": 171, "[Cd]": 172, "[=P+1]": 173, "[P]": 174, "[=Cu]": 175, "[K]": 176, "[Cu+1]": 177, "[Ti+4]": 178, "[\\Cl]": 179, "[Li]": 180, "[Nd]": 181, "[=PH1]": 182, "[Ge]": 183, "[Cu+2]": 184, "[Ta]": 185, "[=Sn]": 186, "[CaH2]": 187, "[/C@@]": 188, "[P@]": 189, "[=Te]": 190, "[C@@H1]": 191, "[Ring3]": 192, "[SnH2]": 193, "[=Ce]": 194, "[#S]": 195, "[=B]": 196, "[Rh]": 197, "[/I]": 198, "[Dy+3]": 199, "[S]": 200, "[=Ring1]": 201, "[Nd+3]": 202, "[Sm+3]": 203, "[Cr]": 204, "[O-2]": 205, "[=Ca]": 206, "[N-1]": 207, "[Mo]": 208, "[As]": 209, "[SH1-1]": 210, "[Pt+2]": 211, "[=O]": 212, "[Hf+4]": 213, "[BH0]": 214, "[P+1]": 215, "[=Ti]": 216, "[Ag+1]": 217, "[Sb]": 218, "[Co]": 219, "[Ba+2]": 220, "[=Zn]": 221, "[Zn+2]": 222, "[NH2+1]": 223, "[=Ni]": 224, "[Sn+4]": 225, "[#B]": 226, "[NH1]": 227, "[Dy]": 228, "[Cs]": 229, "[C]": 230, "[Sb+3]": 231, "[=P]": 232, "[W]": 233, "[/Cl]": 234, "[Cl-1]": 235, "[F]": 236, "[Ni]": 237, "[=Mo]": 238, "[/C]": 239, "[Ce]": 240, "[/Br]": 241, "[=Ring3]": 242, "[PH1]": 243, "[#N]": 244, "[-/Ring2]": 245, "[Br]": 246, "[NH3+1]": 247, "[CH1-1]": 248, "[=N]": 249, "[=Y]": 250, "[=C]": 251, "[Mn+3]": 252, "[=Mn]": 253, "[FH0]": 254, "[Cu]": 255, "[\\N]": 256}}