{"vocab": ["[Nop]", ".", "[Branch3]", "[=P+1]", "[Au+3]", "[/Br]", "[N+1]", "[Ru+3]", "[O+1]", "[V+2]", "[/S]", "[Mg]", "[\\C@@H1]", "[Y+3]", "[Fe+2]", "[Branch2]", "[H-1]", "[#Branch2]", "[Mn]", "[Au+1]", "[C+1]", "[Cd+2]", "[Lu+3]", "[Fe+3]", "[Te]", "[Cd]", "[Cr+3]", "[Hg+2]", "[=V]", "[Gd]", "[#S]", "[Ring3]", "[=Fe]", "[-\\Ring1]", "[=Pb]", "[Mn+2]", "[Hf]", "[Fe]", "[NH1+2]", "[Cl-1]", "[=SnH2]", "[=Si]", "[Sr]", "[OH1-1]", "[\\I]", "[/N+1]", "[/O]", "[=Branch1]", "[F]", "[Ce]", "[=Sn]", "[#O+1]", "[Ce+3]", "[Sn+2]", "[V]", "[\\O]", "[Pt+2]", "[=Ring2]", "[Sr+2]", "[CaH2]", "[=S+1]", "[=Branch2]", "[Sn+4]", "[SH1-2]", "[Nb]", "[Ir]", "[2H]", "[Mg+2]", "[MgH2]", "[=Cu]", "[=Ti]", "[S-2]", "[Ring1]", "[Mo]", "[Hg]", "[NH2+1]", "[\\As]", "[/C]", "[=Y]", "[Sb+3]", "[-/Ring1]", "[N]", "[NH1]", "[=PH1]", "[CH1-1]", "[Ti]", "[H]", "[/C@@]", "[Nd]", "[Ring2]", "[Hg+1]", "[Si]", "[#Branch1]", "[Ag+1]", "[=W]", "[-/Ring2]", "[Cl]", "[Hf+4]", "[/N]", "[Pd+2]", "[Na+1]", "[OH0]", "[I-1]", "[=Sr]", "[Y]", "[=N-1]", "[=Mn]", "[=Te]", "[=N+1]", "[=Ring1]", "[P]", "[CH0]", "[Li+1]", "[=Nb]", "[=Cr]", "[Sb]", "[La]", "[=Be]", "[Co+3]", "[\\S]", "[Zn+2]", "[Pb]", "[Li]", "[Cl+3]", "[#Branch3]", "[Co]", "[=Co]", "[\\N]", "[BH0]", "[Zr+2]", "[Bi]", "[\\Cl]", "[Cr]", "[Ta]", "[S-1]", "[NH1+1]", "[Zr]", "[C@@H1]", "[=Ge]", "[Ni+2]", "[=Branch3]", "[Pr+3]", "[\\C@]", "[/C@]", "[=As]", "[O]", "[=S]", "[P+1]", "[=Zr]", "[Zn]", "[#N+1]", "[P@]", "[/I]", "[Be]", "[=C-1]", "[Cu]", "[NH3+1]", "[\\Br]", "[Ge]", "[/NH1+1]", "[Ba+2]", "[B-1]", "[B]", "[Pb+2]", "[F-1]", "[H+1]", "[As]", "[O-2]", "[\\C@H1]", "[Co+2]", "[=Se]", "[NH4+1]", "[Sm+3]", "[PH0]", "[PH1]", "[C@]", "[C@@]", "[S+1]", "[=Ni]", "[Ca]", "[Ti+4]", "[=Ring3]", "[/C@H1]", "[\\N+1]", "[Ag]", "[\\C]", "[#C-1]", "[Branch1]", "[SnH2]", "[O-1]", "[Nb+5]", "[Cs]", "[=Zn]", "[=B]", "[W]", "[Re]", "[C-1]", "[Ti+2]", "[Rh+3]", "[SH1-1]", "[#N]", "[K]", "[FH0]", "[Ca+2]", "[=P]", "[Br]", "[=O]", "[Cs+1]", "[Si+4]", "[Cu+1]", "[Mn+3]", "[Zr+4]", "[Dy+3]", "[=V+2]", "[=NH1+1]", "[In+3]", "[=N]", "[#C]", "[Al]", "[=Ca]", "[Au]", "[Sn]", "[I]", "[Na]", "[N-1]", "[Pt+4]", "[ClH0]", "[Nd+3]", "[P@@]", "[Mo+2]", "[/C@@H1]", "[#B]", "[C]", "[B+3]", "[=C]", "[=Cd]", "[Dy]", "[=O+1]", "[/Cl]", "[C@H1]", "[La+3]", "[Bi+3]", "[Rh]", "[Al+3]", "[=Mo]", "[K+1]", "[Gd+3]", "[Se]", "[Ni]", "[=Ce]", "[SiH1]", "[Br-1]", "[S]", "[As+3]", "[/NH1]", "[Cu+2]"], "vocab_stoi": {"[Nop]": 0, ".": 1, "[Branch3]": 2, "[=P+1]": 3, "[Au+3]": 4, "[/Br]": 5, "[N+1]": 6, "[Ru+3]": 7, "[O+1]": 8, "[V+2]": 9, "[/S]": 10, "[Mg]": 11, "[\\C@@H1]": 12, "[Y+3]": 13, "[Fe+2]": 14, "[Branch2]": 15, "[H-1]": 16, "[#Branch2]": 17, "[Mn]": 18, "[Au+1]": 19, "[C+1]": 20, "[Cd+2]": 21, "[Lu+3]": 22, "[Fe+3]": 23, "[Te]": 24, "[Cd]": 25, "[Cr+3]": 26, "[Hg+2]": 27, "[=V]": 28, "[Gd]": 29, "[#S]": 30, "[Ring3]": 31, "[=Fe]": 32, "[-\\Ring1]": 33, "[=Pb]": 34, "[Mn+2]": 35, "[Hf]": 36, "[Fe]": 37, "[NH1+2]": 38, "[Cl-1]": 39, "[=SnH2]": 40, "[=Si]": 41, "[Sr]": 42, "[OH1-1]": 43, "[\\I]": 44, "[/N+1]": 45, "[/O]": 46, "[=Branch1]": 47, "[F]": 48, "[Ce]": 49, "[=Sn]": 50, "[#O+1]": 51, "[Ce+3]": 52, "[Sn+2]": 53, "[V]": 54, "[\\O]": 55, "[Pt+2]": 56, "[=Ring2]": 57, "[Sr+2]": 58, "[CaH2]": 59, "[=S+1]": 60, "[=Branch2]": 61, "[Sn+4]": 62, "[SH1-2]": 63, "[Nb]": 64, "[Ir]": 65, "[2H]": 66, "[Mg+2]": 67, "[MgH2]": 68, "[=Cu]": 69, "[=Ti]": 70, "[S-2]": 71, "[Ring1]": 72, "[Mo]": 73, "[Hg]": 74, "[NH2+1]": 75, "[\\As]": 76, "[/C]": 77, "[=Y]": 78, "[Sb+3]": 79, "[-/Ring1]": 80, "[N]": 81, "[NH1]": 82, "[=PH1]": 83, "[CH1-1]": 84, "[Ti]": 85, "[H]": 86, "[/C@@]": 87, "[Nd]": 88, "[Ring2]": 89, "[Hg+1]": 90, "[Si]": 91, "[#Branch1]": 92, "[Ag+1]": 93, "[=W]": 94, "[-/Ring2]": 95, "[Cl]": 96, "[Hf+4]": 97, "[/N]": 98, "[Pd+2]": 99, "[Na+1]": 100, "[OH0]": 101, "[I-1]": 102, "[=Sr]": 103, "[Y]": 104, "[=N-1]": 105, "[=Mn]": 106, "[=Te]": 107, "[=N+1]": 108, "[=Ring1]": 109, "[P]": 110, "[CH0]": 111, "[Li+1]": 112, "[=Nb]": 113, "[=Cr]": 114, "[Sb]": 115, "[La]": 116, "[=Be]": 117, "[Co+3]": 118, "[\\S]": 119, "[Zn+2]": 120, "[Pb]": 121, "[Li]": 122, "[Cl+3]": 123, "[#Branch3]": 124, "[Co]": 125, "[=Co]": 126, "[\\N]": 127, "[BH0]": 128, "[Zr+2]": 129, "[Bi]": 130, "[\\Cl]": 131, "[Cr]": 132, "[Ta]": 133, "[S-1]": 134, "[NH1+1]": 135, "[Zr]": 136, "[C@@H1]": 137, "[=Ge]": 138, "[Ni+2]": 139, "[=Branch3]": 140, "[Pr+3]": 141, "[\\C@]": 142, "[/C@]": 143, "[=As]": 144, "[O]": 145, "[=S]": 146, "[P+1]": 147, "[=Zr]": 148, "[Zn]": 149, "[#N+1]": 150, "[P@]": 151, "[/I]": 152, "[Be]": 153, "[=C-1]": 154, "[Cu]": 155, "[NH3+1]": 156, "[\\Br]": 157, "[Ge]": 158, "[/NH1+1]": 159, "[Ba+2]": 160, "[B-1]": 161, "[B]": 162, "[Pb+2]": 163, "[F-1]": 164, "[H+1]": 165, "[As]": 166, "[O-2]": 167, "[\\C@H1]": 168, "[Co+2]": 169, "[=Se]": 170, "[NH4+1]": 171, "[Sm+3]": 172, "[PH0]": 173, "[PH1]": 174, "[C@]": 175, "[C@@]": 176, "[S+1]": 177, "[=Ni]": 178, "[Ca]": 179, "[Ti+4]": 180, "[=Ring3]": 181, "[/C@H1]": 182, "[\\N+1]": 183, "[Ag]": 184, "[\\C]": 185, "[#C-1]": 186, "[Branch1]": 187, "[SnH2]": 188, "[O-1]": 189, "[Nb+5]": 190, "[Cs]": 191, "[=Zn]": 192, "[=B]": 193, "[W]": 194, "[Re]": 195, "[C-1]": 196, "[Ti+2]": 197, "[Rh+3]": 198, "[SH1-1]": 199, "[#N]": 200, "[K]": 201, "[FH0]": 202, "[Ca+2]": 203, "[=P]": 204, "[Br]": 205, "[=O]": 206, "[Cs+1]": 207, "[Si+4]": 208, "[Cu+1]": 209, "[Mn+3]": 210, "[Zr+4]": 211, "[Dy+3]": 212, "[=V+2]": 213, "[=NH1+1]": 214, "[In+3]": 215, "[=N]": 216, "[#C]": 217, "[Al]": 218, "[=Ca]": 219, "[Au]": 220, "[Sn]": 221, "[I]": 222, "[Na]": 223, "[N-1]": 224, "[Pt+4]": 225, "[ClH0]": 226, "[Nd+3]": 227, "[P@@]": 228, "[Mo+2]": 229, "[/C@@H1]": 230, "[#B]": 231, "[C]": 232, "[B+3]": 233, "[=C]": 234, "[=Cd]": 235, "[Dy]": 236, "[=O+1]": 237, "[/Cl]": 238, "[C@H1]": 239, "[La+3]": 240, "[Bi+3]": 241, "[Rh]": 242, "[Al+3]": 243, "[=Mo]": 244, "[K+1]": 245, "[Gd+3]": 246, "[Se]": 247, "[Ni]": 248, "[=Ce]": 249, "[SiH1]": 250, "[Br-1]": 251, "[S]": 252, "[As+3]": 253, "[/NH1]": 254, "[Cu+2]": 255}}