{"vocab": ["[Nop]", ".", "[Rh+3]", "[Si+4]", "[Se]", "[Cs+1]", "[Zn]", "[\\Br]", "[#Branch1]", "[OH0]", "[Sn]", "[B+3]", "[#N+1]", "[OH1-1]", "[H+1]", "[Hg+1]", "[C@]", "[\\C@]", "[MgH2]", "[/As]", "[C-1]", "[Y+3]", "[Zr]", "[Bi+3]", "[ClH0]", "[Branch2]", "[Cd+2]", "[Ring2]", "[B]", "[=Se]", "[=W]", "[=Cd]", "[=Sr]", "[\\C@@H1]", "[Ca]", "[=Fe]", "[#C]", "[Cl]", "[Ni+2]", "[Pt+4]", "[=Branch1]", "[=Ring2]", "[Au+1]", "[C@H1]", "[Ca+2]", "[Pb]", "[=Nb]", "[Pb+2]", "[#Branch3]", "[Re]", "[Au]", "[Mg+2]", "[=C-1]", "[Ti]", "[Au+3]", "[=Branch2]", "[-\\Ring2]", "[SiH1]", "[Al]", "[Ru+3]", "[In+3]", "[F-1]", "[S-2]", "[=Be]", "[\\NH1+1]", "[Fe+2]", "[P@@]", "[O-1]", "[#C-1]", "[/C@H1]", "[=NH1+1]", "[I]", "[La]", "[Co+3]", "[=O+1]", "[Cl+3]", "[O+1]", "[\\N+1]", "[Sr]", "[Hg+2]", "[Ir]", "[Gd+3]", "[Li+1]", "[Na]", "[Mn+2]", "[Nb+5]", "[K+1]", "[=N+1]", "[-/Ring1]", "[=S+1]", "[Fe+3]", "[O]", "[Br-1]", "[=S]", "[=Pb]", "[Sr+2]", "[Gd]", "[\\NH1]", "[Zr+4]", "[Be]", "[=Ge]", "[/C@]", "[B-1]", "[Ag]", "[Mn]", "[=As]", "[S-1]", "[\\C@H1]", "[H]", "[=SnH2]", "[/NH1]", "[Te]", "[V+2]", "[#Branch2]", "[Y]", "[=Si]", "[\\I]", "[=Cr]", "[NH1+2]", "[Co+2]", "[=Branch3]", "[/O]", "[N+1]", "[C@@]", "[-\\Ring1]", "[=N-1]", "[S+1]", "[Branch1]", "[Branch3]", "[As+3]", "[Mo+2]", "[Pd+2]", "[\\C]", "[/N+1]", "[La+3]", "[2H]", "[Ti+2]", "[Hg]", "[Mg]", "[Ce+3]", "[Al+3]", "[N]", "[Si]", "[=Co]", "[/S]", "[Cr+3]", "[=V]", "[CH0]", "[=V+2]", "[Lu+3]", "[I-1]", "[NH4+1]", "[Zr+2]", "[SH1-2]", "[#O+1]", "[Hf]", "[\\As]", "[NH1+1]", "[Fe]", "[H-1]", "[Ring1]", "[/N]", "[C+1]", "[=Zr]", "[Nb]", "[\\S]", "[Bi]", "[Pr+3]", "[PH0]", "[Sn+2]", "[Na+1]", "[\\O]", "[/C@@H1]", "[V]", "[Cd]", "[=P+1]", "[P]", "[=Cu]", "[K]", "[Cu+1]", "[Ti+4]", "[\\Cl]", "[Li]", "[Nd]", "[=PH1]", "[Ge]", "[Cu+2]", "[Ta]", "[=Sn]", "[CaH2]", "[/C@@]", "[P@]", "[=Te]", "[C@@H1]", "[Ring3]", "[SnH2]", "[=Ce]", "[#S]", "[=B]", "[Rh]", "[/I]", "[Dy+3]", "[S]", "[=Ring1]", "[Nd+3]", "[Sm+3]", "[Cr]", "[O-2]", "[=Ca]", "[N-1]", "[Mo]", "[As]", "[SH1-1]", "[Pt+2]", "[=O]", "[Hf+4]", "[BH0]", "[P+1]", "[=Ti]", "[Ag+1]", "[Sb]", "[Co]", "[Ba+2]", "[=Zn]", "[Zn+2]", "[NH2+1]", "[=Ni]", "[Sn+4]", "[#B]", "[NH1]", "[Dy]", "[Cs]", "[C]", "[Sb+3]", "[=P]", "[W]", "[/Cl]", "[Cl-1]", "[F]", "[Ni]", "[=Mo]", "[/C]", "[Ce]", "[/Br]", "[=Ring3]", "[PH1]", "[#N]", "[-/Ring2]", "[Br]", "[NH3+1]", "[CH1-1]", "[=N]", "[=Y]", "[=C]", "[Mn+3]", "[=Mn]", "[FH0]", "[Cu]", "[\\N]"], "vocab_stoi": {"[Nop]": 0, ".": 1, "[Rh+3]": 2, "[Si+4]": 3, "[Se]": 4, "[Cs+1]": 5, "[Zn]": 6, "[\\Br]": 7, "[#Branch1]": 8, "[OH0]": 9, "[Sn]": 10, "[B+3]": 11, "[#N+1]": 12, "[OH1-1]": 13, "[H+1]": 14, "[Hg+1]": 15, "[C@]": 16, "[\\C@]": 17, "[MgH2]": 18, "[/As]": 19, "[C-1]": 20, "[Y+3]": 21, "[Zr]": 22, "[Bi+3]": 23, "[ClH0]": 24, "[Branch2]": 25, "[Cd+2]": 26, "[Ring2]": 27, "[B]": 28, "[=Se]": 29, "[=W]": 30, "[=Cd]": 31, "[=Sr]": 32, "[\\C@@H1]": 33, "[Ca]": 34, "[=Fe]": 35, "[#C]": 36, "[Cl]": 37, "[Ni+2]": 38, "[Pt+4]": 39, "[=Branch1]": 40, "[=Ring2]": 41, "[Au+1]": 42, "[C@H1]": 43, "[Ca+2]": 44, "[Pb]": 45, "[=Nb]": 46, "[Pb+2]": 47, "[#Branch3]": 48, "[Re]": 49, "[Au]": 50, "[Mg+2]": 51, "[=C-1]": 52, "[Ti]": 53, "[Au+3]": 54, "[=Branch2]": 55, "[-\\Ring2]": 56, "[SiH1]": 57, "[Al]": 58, "[Ru+3]": 59, "[In+3]": 60, "[F-1]": 61, "[S-2]": 62, "[=Be]": 63, "[\\NH1+1]": 64, "[Fe+2]": 65, "[P@@]": 66, "[O-1]": 67, "[#C-1]": 68, "[/C@H1]": 69, "[=NH1+1]": 70, "[I]": 71, "[La]": 72, "[Co+3]": 73, "[=O+1]": 74, "[Cl+3]": 75, "[O+1]": 76, "[\\N+1]": 77, "[Sr]": 78, "[Hg+2]": 79, "[Ir]": 80, "[Gd+3]": 81, "[Li+1]": 82, "[Na]": 83, "[Mn+2]": 84, "[Nb+5]": 85, "[K+1]": 86, "[=N+1]": 87, "[-/Ring1]": 88, "[=S+1]": 89, "[Fe+3]": 90, "[O]": 91, "[Br-1]": 92, "[=S]": 93, "[=Pb]": 94, "[Sr+2]": 95, "[Gd]": 96, "[\\NH1]": 97, "[Zr+4]": 98, "[Be]": 99, "[=Ge]": 100, "[/C@]": 101, "[B-1]": 102, "[Ag]": 103, "[Mn]": 104, "[=As]": 105, "[S-1]": 106, "[\\C@H1]": 107, "[H]": 108, "[=SnH2]": 109, "[/NH1]": 110, "[Te]": 111, "[V+2]": 112, "[#Branch2]": 113, "[Y]": 114, "[=Si]": 115, "[\\I]": 116, "[=Cr]": 117, "[NH1+2]": 118, "[Co+2]": 119, "[=Branch3]": 120, "[/O]": 121, "[N+1]": 122, "[C@@]": 123, "[-\\Ring1]": 124, "[=N-1]": 125, "[S+1]": 126, "[Branch1]": 127, "[Branch3]": 128, "[As+3]": 129, "[Mo+2]": 130, "[Pd+2]": 131, "[\\C]": 132, "[/N+1]": 133, "[La+3]": 134, "[2H]": 135, "[Ti+2]": 136, "[Hg]": 137, "[Mg]": 138, "[Ce+3]": 139, "[Al+3]": 140, "[N]": 141, "[Si]": 142, "[=Co]": 143, "[/S]": 144, "[Cr+3]": 145, "[=V]": 146, "[CH0]": 147, "[=V+2]": 148, "[Lu+3]": 149, "[I-1]": 150, "[NH4+1]": 151, "[Zr+2]": 152, "[SH1-2]": 153, "[#O+1]": 154, "[Hf]": 155, "[\\As]": 156, "[NH1+1]": 157, "[Fe]": 158, "[H-1]": 159, "[Ring1]": 160, "[/N]": 161, "[C+1]": 162, "[=Zr]": 163, "[Nb]": 164, "[\\S]": 165, "[Bi]": 166, "[Pr+3]": 167, "[PH0]": 168, "[Sn+2]": 169, "[Na+1]": 170, "[\\O]": 171, "[/C@@H1]": 172, "[V]": 173, "[Cd]": 174, "[=P+1]": 175, "[P]": 176, "[=Cu]": 177, "[K]": 178, "[Cu+1]": 179, "[Ti+4]": 180, "[\\Cl]": 181, "[Li]": 182, "[Nd]": 183, "[=PH1]": 184, "[Ge]": 185, "[Cu+2]": 186, "[Ta]": 187, "[=Sn]": 188, "[CaH2]": 189, "[/C@@]": 190, "[P@]": 191, "[=Te]": 192, "[C@@H1]": 193, "[Ring3]": 194, "[SnH2]": 195, "[=Ce]": 196, "[#S]": 197, "[=B]": 198, "[Rh]": 199, "[/I]": 200, "[Dy+3]": 201, "[S]": 202, "[=Ring1]": 203, "[Nd+3]": 204, "[Sm+3]": 205, "[Cr]": 206, "[O-2]": 207, "[=Ca]": 208, "[N-1]": 209, "[Mo]": 210, "[As]": 211, "[SH1-1]": 212, "[Pt+2]": 213, "[=O]": 214, "[Hf+4]": 215, "[BH0]": 216, "[P+1]": 217, "[=Ti]": 218, "[Ag+1]": 219, "[Sb]": 220, "[Co]": 221, "[Ba+2]": 222, "[=Zn]": 223, "[Zn+2]": 224, "[NH2+1]": 225, "[=Ni]": 226, "[Sn+4]": 227, "[#B]": 228, "[NH1]": 229, "[Dy]": 230, "[Cs]": 231, "[C]": 232, "[Sb+3]": 233, "[=P]": 234, "[W]": 235, "[/Cl]": 236, "[Cl-1]": 237, "[F]": 238, "[Ni]": 239, "[=Mo]": 240, "[/C]": 241, "[Ce]": 242, "[/Br]": 243, "[=Ring3]": 244, "[PH1]": 245, "[#N]": 246, "[-/Ring2]": 247, "[Br]": 248, "[NH3+1]": 249, "[CH1-1]": 250, "[=N]": 251, "[=Y]": 252, "[=C]": 253, "[Mn+3]": 254, "[=Mn]": 255, "[FH0]": 256, "[Cu]": 257, "[\\N]": 258}}