{"vocab": ["[nop]", ".", "[N@]", "[Se]", "[Li+1]", "[=Ge]", "[\\N]", "[Mg+2]", "[ClH0]", "[Ba+2]", "[N]", "[=Mo]", "[SH1-2]", "[=O]", "[Zr+4]", "[\\N+1]", "[/Br]", "[Mo+2]", "[/-Ring1]", "[=SH0]", "[Sn]", "[=Si]", "[N-1]", "[Fe+2]", "[FH0]", "[B-1]", "[2H]", "[/N+1]", "[Cl-1]", "[=V+2]", "[\\NH1+1]", "[=N]", "[CH0]", "[P@@]", "[=Fe]", "[\\S]", "[Cl]", "[Al+3]", "[\\-Ring2]", "[As+3]", "[Ring1]", "[Sm+3]", "[=Ni]", "[Co+2]", "[NH1+2]", "[\\C@H1]", "[Mo]", "[S-2]", "[=PH0]", "[Zn]", "[Cr]", "[Br-1]", "[=P]", "[S]", "[#Branch2]", "[-/Ring1]", "[\\C@@H1]", "[NH2+1]", "[Sr]", "[=Cr]", "[=N-1]", "[=SnH2]", "[\\NH1]", "[PH0]", "[NH0]", "[Gd]", "[Na]", "[/C@@H1]", "[Au+1]", "[Ce]", "[Dy]", "[=Ti]", "[CH2]", "[Hg]", "[=Ring2]", "[=Zr]", "[Zr+2]", "[I]", "[Si]", "[=Branch1]", "[K]", "[BH0]", "[Pr+3]", "[Nd+3]", "[Ag+1]", "[In+3]", "[Cl+3]", "[Cu]", "[O-2]", "[W]", "[N+1]", "[=Ca]", "[=S]", "[=P+1]", "[/N]", "[#O+1]", "[H+1]", "[Nb+5]", "[NH3+1]", "[Branch3]", "[Gd+3]", "[Zn+2]", "[/C@]", "[Cd+2]", "[Ce+3]", "[Pb+2]", "[Na+1]", "[#Branch1]", "[Lu+3]", "[MgH2]", "[\\Br]", "[-/Ring2]", "[NH1+1]", "[S-1]", "[I-1]", "[O]", "[=V]", "[Y]", "[Rh]", "[#S]", "[Cs+1]", "[Ni]", "[H]", "[#N]", "[Cu+1]", "[=PH1]", "[SH1-1]", "[=Mn]", "[Mn+3]", "[#C]", "[Branch2]", "[Sb+3]", "[=B]", "[\\As]", "[=Sn]", "[H-1]", "[=Ce]", "[B+3]", "[=O+1]", "[=Branch2]", "[K+1]", "[=Pb]", "[P@]", "[Al]", "[=Ring1]", "[Co]", "[Be]", "[=Se]", "[/I]", "[C@@H1]", "[/S]", "[Ring2]", "[Ni+2]", "[/As]", "[C]", "[Ta]", "[F-1]", "[Sb]", "[Au]", "[/NH1+1]", "[Zr]", "[CH1-1]", "[Rh+3]", "[Si@]", "[\\O]", "[-\\Ring1]", "[SnH2]", "[Bi+3]", "[Fe]", "[Hf]", "[=NH1+1]", "[Pb]", "[\\Cl]", "[Ca+2]", "[Ir]", "[Pt+2]", "[Hg+2]", "[#B]", "[Ge]", "[=Te]", "[Nd]", "[OH1-1]", "[NH1]", "[C+1]", "[Co+3]", "[=Cd]", "[Y+3]", "[Ti+2]", "[Au+3]", "[OH0]", "[Pd+2]", "[O+1]", "[=As]", "[/C]", "[Hg+1]", "[=N+1]", "[Sn+2]", "[O-1]", "[F]", "[NH4+1]", "[Re]", "[/O]", "[Sr+2]", "[/-Ring2]", "[Dy+3]", "[S+1]", "[Sn+4]", "[\\I]", "[Ti+4]", "[Mn+2]", "[Mg]", "[B]", "[La]", "[=W]", "[Cs]", "[#C-1]", "[=Sr]", "[=S+1]", "[=Be]", "[C@H1]", "[\\C]", "[Ca]", "[Si+4]", "[PH1]", "[Nb]", "[Cr+3]", "[Branch1]", "[Hf+4]", "[=Nb]", "[P]", "[CH1]", "[Ag]", "[=C-1]", "[\\-Ring1]", "[C-1]", "[C@@]", "[/Cl]", "[Cu+2]", "[Cd]", "[CaH2]", "[=Co]", "[/C@@]", "[Li]", "[Ti]", "[=C]", "[P+1]", "[=CH0]", "[=Y]", "[V+2]", "[SiH1]", "[V]", "[La+3]", "[Ru+3]", "[=Cu]", "[C@]", "[Fe+3]", "[Te]", "[=Zn]", "[Bi]", "[Br]", "[/C@H1]", "[Mn]", "[SH0]", "[Pt+4]", "[As]", "[/NH1]", "[Nop]", "[Ring3]", "[#Branch3]", "[=Branch3]", "[\\C@]", "[#N+1]", "[=Ring3]"], "vocab_stoi": {"[nop]": 0, ".": 1, "[N@]": 2, "[Se]": 3, "[Li+1]": 4, "[=Ge]": 5, "[\\N]": 6, "[Mg+2]": 7, "[ClH0]": 8, "[Ba+2]": 9, "[N]": 10, "[=Mo]": 11, "[SH1-2]": 12, "[=O]": 13, "[Zr+4]": 14, "[\\N+1]": 15, "[/Br]": 16, "[Mo+2]": 17, "[/-Ring1]": 18, "[=SH0]": 19, "[Sn]": 20, "[=Si]": 21, "[N-1]": 22, "[Fe+2]": 23, "[FH0]": 24, "[B-1]": 25, "[2H]": 26, "[/N+1]": 27, "[Cl-1]": 28, "[=V+2]": 29, "[\\NH1+1]": 30, "[=N]": 31, "[CH0]": 32, "[P@@]": 33, "[=Fe]": 34, "[\\S]": 35, "[Cl]": 36, "[Al+3]": 37, "[\\-Ring2]": 38, "[As+3]": 39, "[Ring1]": 40, "[Sm+3]": 41, "[=Ni]": 42, "[Co+2]": 43, "[NH1+2]": 44, "[\\C@H1]": 45, "[Mo]": 46, "[S-2]": 47, "[=PH0]": 48, "[Zn]": 49, "[Cr]": 50, "[Br-1]": 51, "[=P]": 52, "[S]": 53, "[#Branch2]": 54, "[-/Ring1]": 55, "[\\C@@H1]": 56, "[NH2+1]": 57, "[Sr]": 58, "[=Cr]": 59, "[=N-1]": 60, "[=SnH2]": 61, "[\\NH1]": 62, "[PH0]": 63, "[NH0]": 64, "[Gd]": 65, "[Na]": 66, "[/C@@H1]": 67, "[Au+1]": 68, "[Ce]": 69, "[Dy]": 70, "[=Ti]": 71, "[CH2]": 72, "[Hg]": 73, "[=Ring2]": 74, "[=Zr]": 75, "[Zr+2]": 76, "[I]": 77, "[Si]": 78, "[=Branch1]": 79, "[K]": 80, "[BH0]": 81, "[Pr+3]": 82, "[Nd+3]": 83, "[Ag+1]": 84, "[In+3]": 85, "[Cl+3]": 86, "[Cu]": 87, "[O-2]": 88, "[W]": 89, "[N+1]": 90, "[=Ca]": 91, "[=S]": 92, "[=P+1]": 93, "[/N]": 94, "[#O+1]": 95, "[H+1]": 96, "[Nb+5]": 97, "[NH3+1]": 98, "[Branch3]": 99, "[Gd+3]": 100, "[Zn+2]": 101, "[/C@]": 102, "[Cd+2]": 103, "[Ce+3]": 104, "[Pb+2]": 105, "[Na+1]": 106, "[#Branch1]": 107, "[Lu+3]": 108, "[MgH2]": 109, "[\\Br]": 110, "[-/Ring2]": 111, "[NH1+1]": 112, "[S-1]": 113, "[I-1]": 114, "[O]": 115, "[=V]": 116, "[Y]": 117, "[Rh]": 118, "[#S]": 119, "[Cs+1]": 120, "[Ni]": 121, "[H]": 122, "[#N]": 123, "[Cu+1]": 124, "[=PH1]": 125, "[SH1-1]": 126, "[=Mn]": 127, "[Mn+3]": 128, "[#C]": 129, "[Branch2]": 130, "[Sb+3]": 131, "[=B]": 132, "[\\As]": 133, "[=Sn]": 134, "[H-1]": 135, "[=Ce]": 136, "[B+3]": 137, "[=O+1]": 138, "[=Branch2]": 139, "[K+1]": 140, "[=Pb]": 141, "[P@]": 142, "[Al]": 143, "[=Ring1]": 144, "[Co]": 145, "[Be]": 146, "[=Se]": 147, "[/I]": 148, "[C@@H1]": 149, "[/S]": 150, "[Ring2]": 151, "[Ni+2]": 152, "[/As]": 153, "[C]": 154, "[Ta]": 155, "[F-1]": 156, "[Sb]": 157, "[Au]": 158, "[/NH1+1]": 159, "[Zr]": 160, "[CH1-1]": 161, "[Rh+3]": 162, "[Si@]": 163, "[\\O]": 164, "[-\\Ring1]": 165, "[SnH2]": 166, "[Bi+3]": 167, "[Fe]": 168, "[Hf]": 169, "[=NH1+1]": 170, "[Pb]": 171, "[\\Cl]": 172, "[Ca+2]": 173, "[Ir]": 174, "[Pt+2]": 175, "[Hg+2]": 176, "[#B]": 177, "[Ge]": 178, "[=Te]": 179, "[Nd]": 180, "[OH1-1]": 181, "[NH1]": 182, "[C+1]": 183, "[Co+3]": 184, "[=Cd]": 185, "[Y+3]": 186, "[Ti+2]": 187, "[Au+3]": 188, "[OH0]": 189, "[Pd+2]": 190, "[O+1]": 191, "[=As]": 192, "[/C]": 193, "[Hg+1]": 194, "[=N+1]": 195, "[Sn+2]": 196, "[O-1]": 197, "[F]": 198, "[NH4+1]": 199, "[Re]": 200, "[/O]": 201, "[Sr+2]": 202, "[/-Ring2]": 203, "[Dy+3]": 204, "[S+1]": 205, "[Sn+4]": 206, "[\\I]": 207, "[Ti+4]": 208, "[Mn+2]": 209, "[Mg]": 210, "[B]": 211, "[La]": 212, "[=W]": 213, "[Cs]": 214, "[#C-1]": 215, "[=Sr]": 216, "[=S+1]": 217, "[=Be]": 218, "[C@H1]": 219, "[\\C]": 220, "[Ca]": 221, "[Si+4]": 222, "[PH1]": 223, "[Nb]": 224, "[Cr+3]": 225, "[Branch1]": 226, "[Hf+4]": 227, "[=Nb]": 228, "[P]": 229, "[CH1]": 230, "[Ag]": 231, "[=C-1]": 232, "[\\-Ring1]": 233, "[C-1]": 234, "[C@@]": 235, "[/Cl]": 236, "[Cu+2]": 237, "[Cd]": 238, "[CaH2]": 239, "[=Co]": 240, "[/C@@]": 241, "[Li]": 242, "[Ti]": 243, "[=C]": 244, "[P+1]": 245, "[=CH0]": 246, "[=Y]": 247, "[V+2]": 248, "[SiH1]": 249, "[V]": 250, "[La+3]": 251, "[Ru+3]": 252, "[=Cu]": 253, "[C@]": 254, "[Fe+3]": 255, "[Te]": 256, "[=Zn]": 257, "[Bi]": 258, "[Br]": 259, "[/C@H1]": 260, "[Mn]": 261, "[SH0]": 262, "[Pt+4]": 263, "[As]": 264, "[/NH1]": 265, "[Nop]": 266, "[Ring3]": 267, "[#Branch3]": 268, "[=Branch3]": 269, "[\\C@]": 270, "[#N+1]": 271, "[=Ring3]": 272}}